CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_rcu.c
    /* calculate the minimum factor of PLLN */
    if((ss_modulation_reg & RCU_PLLSSCTL_SSCGON) == RCU_PLLSSCTL_SSCGON){
        if((ss_modulation_reg & RCU_SS_TYPE_DOWN) == RCU_SS_TYPE_DOWN){
            ss_modulation_inc += RCU_SS_MODULATION_DOWN_INC;
        }else{
            ss_modulation_inc += RCU_SS_MODULATION_CENTER_INC;
        }
    }
    
    /* check the function parameter */
    if(CHECK_PLL_PSC_VALID(pll_psc) && CHECK_PLL_N_VALID(pll_n,ss_modulation_inc) && 
       CHECK_PLL_P_VALID(pll_p)){
         RCU_PLL = pll_psc | (pll_n << 6) | (((pll_p >> 1) - 1U) << 16) |
                   (pll_src);
    }else{
        /* return status */
        return ERROR;
    }
    
    /* return status */
    return SUCCESS;
}

/*!
    \brief      configure the PLLI2S clock
    \param[in]  plli2s_n: PLLI2S clock VCO clock multiplication factor
      \arg        this parameter should be selected between 8 and 127
    \param[in]  plli2s_psc: PLLI2S VCO source clock pre-scale
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLI2SSRC_DIVx(x=1,2,...,8): PLLI2S vco input source clock divided by x
    \param[in]  plli2s_div: PLLI2SDIV clock divider factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLI2S_DIVx(x=1_5,2,2_5,3,...,32): PLLI2SDIV input source clock divided by x
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_plli2s_config(uint32_t plli2s_n, uint32_t plli2s_psc,uint32_t plli2s_div)
{
    /* check the function parameter */
    if(CHECK_PLLI2S_N_VALID(plli2s_n) ){
        if(RCU_PLLI2S_DIV32 == plli2s_div){
            RCU_PLLCFG &= ~(RCU_PLLCFG_PLLI2SDIV|RCU_PLLCFG_PLLI2SN|RCU_PLLCFG_PLLI2SPSC);
            RCU_PLLCFG |= (plli2s_n << 8U) | plli2s_psc;
        }
        else{
            RCU_PLLCFG &= ~(RCU_PLLCFG_PLLI2SDIV|RCU_PLLCFG_PLLI2SN|RCU_PLLCFG_PLLI2SPSC);
            RCU_PLLCFG |= (plli2s_n << 8U) | plli2s_psc| plli2s_div;
        }
    }else{
        /* return status */
        return ERROR;
    }
    
    /* return status */
    return SUCCESS;  
}

/*!
    \brief      configure the PLLDIG output clock frequency
    \param[in]  plldig_clk: the PLLDIG VCO clock this parameter sselection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLDIG_192M: selected 192Mhz as PLLDIG output frequency
      \arg        RCU_PLLDIG_240M: selected 240Mhz as PLLDIG output frequency
      \arg        RCU_PLLDIG_320M: selected 320Mhz as PLLDIG output frequency
      \arg        RCU_PLLDIG_480M: selected 480Mhz as PLLDIG output frequency
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
void rcu_plldig_config(uint32_t plldig_clk)
{
       RCU_PLLCFG &= ~(RCU_PLLCFG_PLLDIGOSEL);

       RCU_PLLCFG |= plldig_clk;
}

/*!
    \brief      configure PLLDIG clock divider factor for system clock
    \param[in]  plldigfsys_div: PLLDIG clock divider factor for system clock
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLDIGFSYS_DIVx(x=1,2,3,...,64): PLLDIG clock divided by x for system clock
    \param[out] none
    \retval     none
*/
void rcu_plldigfsys_div_config(uint32_t plldigfsys_div)
{
    uint32_t reg;

    reg = RCU_PLLCFG;
    /* reset the PLLDIGFSYSDIV bits and set according to plldigfsys_div */
    reg &= ~RCU_PLLCFG_PLLDIGFSYSDIV;
    RCU_PLLCFG = (reg | plldigfsys_div);
}

/*!
    \brief      configure the RTC clock source selection
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC32K: CK_IRC32K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_RTCDIV: CK_HXTAL/RTCDIV selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;
    
    reg = RCU_BDCTL; 
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    RCU_BDCTL = (reg | rtc_clock_source);
}

/*!
    \brief      configure the frequency division of RTC clock when HXTAL was selected as its clock source 
    \param[in]  rtc_div: RTC clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTC_HXTAL_NONE: no clock for RTC
      \arg        RCU_RTC_HXTAL_DIVx: RTCDIV clock select CK_HXTAL/x, x = 2....31
    \param[out] none
    \retval     none
*/
void rcu_rtc_div_config(uint32_t rtc_div)
{
    uint32_t reg;    
    reg = RCU_CFG0; 
    /* reset the RTCDIV bits and set according to rtc_div value */
    reg &= ~RCU_CFG0_RTCDIV;
    RCU_CFG0 = (reg | rtc_div);
}

/*!
    \brief      configure the I2S clock source selection
    \param[in]  i2s_clock_source: I2S clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2SSRC_PLLI2S: CK_PLLI2S selected as I2S source clock
      \arg        RCU_I2SSRC_I2S_CKIN: external i2s_ckin pin selected as I2S source clock
      \arg        RCU_I2SSRC_I2S_PLLDIV: PLL division selected as I2S source clock
    \param[out] none
    \retval     none
*/
void rcu_i2s_clock_config(uint32_t i2s_clock_source)
{
    uint32_t reg;
    
    reg = RCU_ADDCTL; 
    /* reset the I2SSEL bit and set according to i2s_clock_source */
    reg &= ~RCU_ADDCTL_I2SSEL;
    RCU_ADDCTL = (reg | i2s_clock_source);
}

/*!
    \brief      configure the PLL divider factor for I2S clock 
    \param[in]  pllfi2s_div: PLL divider factor for I2S clock
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLFI2SDIV_DIVx(x=1,2,...,64): PLL clock divided by x for I2S clock
    \param[out] none
    \retval     none
*/
void rcu_pllfi2s_clock_div_config(uint32_t pllfi2s_div)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the PLLFI2SDIV bits and set according to pllfi2s_div */
    reg &= ~RCU_ADDCTL_PLLFI2SDIV;
    RCU_ADDCTL = (reg | pllfi2s_div);
}

#if (defined(GD32W515PI) || defined(GD32W515P0))
/*!
    \brief      configure the hpdf clock source selection
    \param[in]  hpdf_clock_source: hpdf clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFSRC_PCLK2: PCLK2 clock selected as HPDF source clock
      \arg        RCU_HPDFSRC_CKSYS: System clock selected as HPDF source clock
    \param[out] none
    \retval     none
*/
void rcu_hpdf_clock_config(uint32_t hpdf_clock_source)
{
    uint32_t reg;
    
    reg = RCU_ADDCTL; 
    /* reset the HPDFSEL bit and set according to hpdf_clock_source */
    reg &= ~RCU_ADDCTL_HPDFSEL;
    RCU_ADDCTL = (reg | hpdf_clock_source);
}

/*!
    \brief      configure the HPDF AUDIO clock source selection
    \param[in]  hpdfaudio_clock_source: HPDF AUDIO clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFAUDIOSRC_PLLI2S: PLLI2S output clock selected as HPDF AUDIO source clock
      \arg        RCU_HPDFAUDIOSRC_I2S_CKIN: external I2S_CKIN PIN selected as HPDF AUDIO source clock
      \arg        RCU_HPDFAUDIOSRC_PLL: PLL division selected as HPDF AUDIO source clock
      \arg        RCU_HPDFAUDIOSRC_IRC16M: IRC16M selected as HPDF AUDIO source clock
    \param[out] none
    \retval     none
*/
void rcu_hpdf_audio_clock_config(uint32_t hpdfaudio_clock_source)
{
    uint32_t reg;
    
    reg = RCU_ADDCTL; 
    /* reset the HPDFAUDIOSEL bit and set according to hpdfaudio_clock_source */
    reg &= ~RCU_ADDCTL_HPDFAUDIOSEL;
    RCU_ADDCTL = (reg | hpdfaudio_clock_source);
}
#endif /* GD32W515PI and GD32W515P0 */

/*!
    \brief      configure the SDIO clock source selection
    \param[in]  sdio_clock_source: SDIO clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SDIOSRC_PLL: PLL output clock selected as SDIO source clock
      \arg        RCU_SDIOSRC_PLLDIG: PLLDIG selected as SDIO source clock
      \arg        RCU_SDIOSRC_IRC16M: IRC16M selected as SDIO source clock
      \arg        RCU_SDIOSRC_HXTAL: HXTAL selected as SDIO source clock
    \param[out] none
    \retval     none
*/
void rcu_sdio_clock_config(uint32_t sdio_clock_source)
{
    uint32_t reg;
    
    reg = RCU_ADDCTL; 
    /* reset the SDIOSEL bit and set according to sdio_clock_source */
    reg &= ~(RCU_SDIOSRC_MASK);
    RCU_ADDCTL = (reg | sdio_clock_source);
}

/*!
    \brief      configure the frequency division of the sdio source clock 
    \param[in]  sdio_div: SDIO clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_SDIODIV_DIVx: SDIODIV input source clock divided by x, x = 1,...,32
    \param[out] none
    \retval     none
*/
void rcu_sdio_div_config(uint32_t sdio_div)
{
    uint32_t reg;    
    reg = RCU_ADDCTL; 
    /* reset the RTCDIV bits and set according to rtc_div value */
    reg &= ~RCU_ADDCTL_SDIODIV;
    RCU_ADDCTL = (reg | sdio_div);
}

/*!
    \brief      configure the USBFS clock source selection
    \param[in]  usbfs_clock_source: USBFS clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBFSSRC_PLL: PLL clock selected as USB source clock
      \arg        RCU_USBFSSRC_PLLDIG: PLLDIG clock selected as USB source clock
    \param[out] none
    \retval     none
*/
void rcu_usbfs_clock_config(uint32_t usbfs_clock_source)
{
    uint32_t reg;
    
    reg = RCU_ADDCTL; 
    /* reset the USBFSSEL bit and set according to usbfs_clock_source */
    reg &= ~RCU_ADDCTL_USBFSSEL;
    RCU_ADDCTL = (reg | usbfs_clock_source);
}

/*!
    \brief      configure the frequency division of the usbfs source clock 
    \param[in]  usbfs_div: USBFS clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBFS_DIVx: USBFSDIV input source clock divided by x, x = 1....32
    \param[out] none
    \retval     none
*/
void rcu_usbfs_div_config(uint32_t usbfs_div)
{
    uint32_t reg;    
    reg = RCU_ADDCTL; 
    /* reset the RTCDIV bits and set according to rtc_div value */
    reg &= ~RCU_ADDCTL_USBFSDIV;
    RCU_ADDCTL = (reg | usbfs_div);
}

/*!
    \brief      configure the I2C0 clock source selection
    \param[in]  i2c0_clock_source: I2C0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2C0SRC_CKAPB1: CK_APB1 selected as I2C0 source clock
      \arg        RCU_I2C0SRC_CKSYS: CK_SYS selected as I2C0 source clock
      \arg        RCU_I2C0SRC_IRC16M: CK_IRC16M selected as I2C0 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2c0_clock_config(uint32_t i2c0_clock_source)
{
    uint32_t reg;
    
