CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_rcu.c
/*!
    \brief      get the peripherals clock secure flag
    \param[in]  sec_flag: secure flag, refer to rcu_sec_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SEC_FLAG_IRC16MSEC: IRC16M secure flag 
      \arg        RCU_SEC_FLAG_HXTALSEC: HXTAL secure flag 
      \arg        RCU_SEC_FLAG_IRC32KSEC: LXTAL secure flag
      \arg        RCU_SEC_FLAG_LXTALSEC: LXTAL clock secure flag
      \arg        RCU_SEC_FLAG_SYSCLKSEC: SYSCLK secure flag
      \arg        RCU_SEC_FLAG_PRESCSEC: PRESC secure flag
      \arg        RCU_SEC_FLAG_PLLSEC: PLL secure flag 
      \arg        RCU_SEF_PLLDIGSEC: PLLDIG secure flag
      \arg        RCU_SEC_FLAG_PLLI2SSEC: PLLI2S secure flag
      \arg        RCU_SEC_FLAG_RMVRSTSEC: RMVRST secure flag
      \arg        RCU_SEC_FLAG_BKPSEC: BKP secure flag
      \arg        RCU_SEC_FLAG_AHB1_PxSEC:(x=A,B,C): GPIO port x security flag
      \arg        RCU_SEC_FLAG_AHB1_WIFI: WIFI security flag
      \arg        RCU_SEC_FLAG_AHB1_SRAMx: (x=0,1,2,3): SRAMx security flag
      \arg        RCU_SEC_FLAG_AHB1_DMAx:(x=0,1): DMAx security flag
      \arg        RCU_SEC_FLAG_AHB2_DCI (not available for GD32W515TX series): DCI security flag
      \arg        RCU_SEC_FLAG_AHB2_PKCAU: PKCAU security flag
      \arg        RCU_SEC_FLAG_AHB2_CAU: CAU security flag
      \arg        RCU_SEC_FLAG_AHB2_HAU: HAU security flag
      \arg        RCU_SEC_FLAG_AHB2_TRNG: TRNG security flag
      \arg        RCU_SEC_FLAG_AHB3_SQPI: SQPI security flag
      \arg        RCU_SEC_FLAG_AHB2_QSPI: QSPI security flag
      \arg        RCU_SEC_FLAG_APB1_TIMERx: (x=0,1,2,3,4,5,15,16): TIMERx security flag
      \arg        RCU_SEC_FLAG_APB1_WWDGT:  WWDGT security flag
      \arg        RCU_SEC_FLAG_APB1_SPI1: SPI1 security flag
      \arg        RCU_SEC_FLAG_APB1_USARTx: (x=0,1,2): USARTx security flag
      \arg        RCU_SEC_FLAG_APB1_I2Cx: (x=0,1): I2Cx security flag
      \arg        RCU_SEC_FLAG_APB1_PMU: PMU security flag
      \arg        RCU_SEC_FLAG_APB2_ADC: ADC security flag
      \arg        RCU_SEC_FLAG_APB2_SDIO: SDIO security flag
      \arg        RCU_SEC_FLAG_APB2_SPI0: SPI0 security flag
      \arg        RCU_SEC_FLAG_APB2_SYSCFG: SYSCFG security flag
      \arg        RCU_SEC_FLAG_APB2_HPDF: HPDF security flag
      \arg        RCU_SEC_FLAG_APB2_RF: RF security flag 
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_security_flag_get(rcu_sec_flag_enum sec_flag)
{
    /* get the rcu interrupt flag */
    if(RESET != (RCU_REG_VAL(sec_flag) & BIT(RCU_BIT_POS(sec_flag)))){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      get the system clock, bus and peripheral clock frequency
    \param[in]  clock: the clock frequency which to get
                only one parameter can be selected which is shown as below:
      \arg        CK_SYS: system clock frequency
      \arg        CK_AHB: AHB clock frequency
      \arg        CK_APB1: APB1 clock frequency
      \arg        CK_APB2: APB2 clock frequency
      \arg        CK_USART0: USART0 clock frequency
      \arg        CK_USART2: USART2 clock frequency
      \arg        CK_I2C0: I2C0 clock frequency
    \param[out] none
    \retval     clock frequency of system, AHB, APB1, APB2
*/
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock)
{
    uint32_t sws, ck_freq = 0U;
    uint32_t cksys_freq, ahb_freq, apb1_freq, apb2_freq;
    uint32_t usart2_freq = 0U, usart0_freq = 0U,i2c0_freq = 0U;    
    uint32_t pllpsc, plln, pllsel, pllp, ck_src, idx, clk_exp;
    
    /* exponent of AHB, APB1 and APB2 clock divider */
    const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
    const uint8_t apb1_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    const uint8_t apb2_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws){
    /* IRC16M is selected as CK_SYS */
    case SEL_IRC16M:
        cksys_freq = IRC16M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        cksys_freq = HXTAL_VALUE;
        break;
    /* PLLP is selected as CK_SYS */
    case SEL_PLLP:
        /* get the value of PLLPSC[5:0] */
        pllpsc = GET_BITS(RCU_PLL, 0U, 5U);
        plln = GET_BITS(RCU_PLL, 6U, 14U);
        pllp = (GET_BITS(RCU_PLL, 16U, 17U) + 1U) * 2U;
        /* PLL clock source selection, HXTAL or IRC16M/2 */
        pllsel = (RCU_PLL & RCU_PLL_PLLSEL);
        if (RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else {
            ck_src = IRC16M_VALUE;
        }
        cksys_freq = ((ck_src / pllpsc) * plln)/pllp;
        break;
    /* IRC16M is selected as CK_SYS */
    default:
        cksys_freq = IRC16M_VALUE;
        break;
    }
    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    ahb_freq = cksys_freq >> clk_exp;
    
    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 10, 12);
    clk_exp = apb1_exp[idx];
    apb1_freq = ahb_freq >> clk_exp;
    
    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 13, 15);
    clk_exp = apb2_exp[idx];
    apb2_freq = ahb_freq >> clk_exp;
    
    /* return the clocks frequency */
    switch(clock){
    case CK_SYS:
        ck_freq = cksys_freq;
        break;
    case CK_AHB:
        ck_freq = ahb_freq;
        break;
    case CK_APB1:
        ck_freq = apb1_freq;
        break;
    case CK_APB2:
        ck_freq = apb2_freq;
        break;
    case CK_USART0:
        /* calculate USART0 clock frequency */
        if(RCU_USART0SRC_CKAPB1 == (RCU_CFG1 & RCU_CFG1_USART0SEL)){
            usart0_freq = apb1_freq;
        }else if(RCU_USART0SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_USART0SEL)){
            usart0_freq = cksys_freq;
        }else if(RCU_USART0SRC_LXTAL == (RCU_CFG1 & RCU_CFG1_USART0SEL)){
            usart0_freq = LXTAL_VALUE;
        }else if(RCU_USART0SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_USART0SEL)){
            usart0_freq = IRC16M_VALUE;
        }else{
        }
        ck_freq = usart0_freq;
        break;
    case CK_USART2:
        /* calculate USART2 clock frequency */
        if(RCU_USART2SRC_CKAPB2 == (RCU_CFG1 & RCU_CFG1_USART2SEL)){
            usart2_freq = apb2_freq;
        }else if(RCU_USART2SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_USART2SEL)){
            usart2_freq = cksys_freq;
        }else if(RCU_USART2SRC_LXTAL == (RCU_CFG1 & RCU_CFG1_USART2SEL)){
            usart2_freq = LXTAL_VALUE;
        }else if(RCU_USART2SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_USART2SEL)){
            usart2_freq = IRC16M_VALUE;
        }else{
        }
        ck_freq = usart2_freq;
        break;
    case CK_I2C0:
        /* calculate I2C0 clock frequency */
        if(RCU_I2C0SRC_CKAPB1 == (RCU_CFG1 & RCU_CFG1_I2C0SEL)){
            i2c0_freq = apb1_freq;
        }else if(RCU_I2C0SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_I2C0SEL)){
            i2c0_freq = cksys_freq;
        }else if(RCU_I2C0SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_I2C0SEL)){
            i2c0_freq = IRC16M_VALUE;
        }else{
        }
        ck_freq = i2c0_freq;
        break;
    default:
        break;
    }
    return ck_freq;
}
